CI4-wisata/wisata/app/Controllers/PengunjungController.php

    public function getPengunjung()
    {
        $model = new M_pengunjung();

        $data = $model->table("pengunjung")
            ->findAll();
---
SELECT *
FROM `pengunjung`