CI4-wisata/wisata/app/Controllers/WisataController.php

    public function getWisata()
    {
        $model = new M_wisata();

        $data = $model->table("wisata")
            ->join("kategori", "wisata.id_kategori = kategori.id")
            ->findAll();
---
SELECT *
FROM `wisata`
JOIN `kategori` ON `wisata`.`id_kategori` = `kategori`.`id`